Revit 2027 API
StructuralSectionLAngle.BoltSpacing1LongerFlange Property
 Standard bolt spacing first row in the longer flange, in. (mm)
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double BoltSpacing1LongerFlange { get; set; }
Public Property BoltSpacing1LongerFlange As Double
	Get
	Set
public:
property double BoltSpacing1LongerFlange {
	double get ();
	void set (double value);
}
member BoltSpacing1LongerFlange : float with get, set
Property Value
Double
See Also
Reference
StructuralSectionLAngle Class
Autodesk.Revit.DB.Structure.StructuralSections Namespace